/* Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3 


Console.WriteLine("Введите 1-ое число");

int a = int.Parse(Console.ReadLine());

Console.WriteLine("Введите 2-ое число");

int b = int.Parse(Console.ReadLine());

if( a > b){
    Console.WriteLine("Первое число является больше второго");
}

else  {
    Console.WriteLine("Первое число меньше второго");
}
*/



